Extras/Bignum/README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Bignum module for Youtoo 0.93</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="July 1997; Updated February 2010"/>
<meta name="author" content="Danius Michaelides and Andreas Kind"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Bignum module for Youtoo 0.93</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Copyright </a></li>
<li><a href="#sec-2">2 EuLisp index </a></li>
<li><a href="#sec-3">3 General Description </a></li>
<li><a href="#sec-4">4 Installation </a></li>
<li><a href="#sec-5">5 Files </a></li>
<li><a href="#sec-6">6 To Do </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="COPYING">Copyright</a> </h2>
<div class="outline-text-2" id="text-1">

<p>Youtoo is free software: you can redistribute it and/or modify it
under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.
</p>
<p>
Youtoo is distributed in the hope that it will be useful, but WITHOUT
ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
for more details.
</p>
<p>
You should have received a copy of the GNU General Public License along with
Youtoo in the file <a href="../../COPYING">COPYING</a>.  If not, see <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="../../index.html">EuLisp index</a> </h2>
<div class="outline-text-2" id="text-2">


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> General Description </h2>
<div class="outline-text-2" id="text-3">

<p>This is an interface module to the GNU Bignum package.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Installation </h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>
Run 'make' in directory <i>Extras/Bignum</i>.
</li>
<li>
Run 'make test' in directory <i>Extras/Bignum</i>.
</li>
<li>
Add -lbignum to CLIBS in <i>youtoo/\.eulrc.${ARCH}</i>.

</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Files </h2>
<div class="outline-text-2" id="text-5">

<p>The bignum library consists of a number of EuLisp modules:
</p><ul>
<li>
<i>bignum.em</i> &ndash; root module
</li>
<li>
<i>bigint.em</i> &ndash; big integer module and class
</li>
<li>
<i>bigrat.em</i> &ndash; rational number module and class
</li>
<li>
<i>mpz.em</i>    &ndash; module containing bindings to c functions
</li>
<li>
<i>mpq.em</i>    &ndash; module containing bindings to c functions

</li>
</ul>

<p>And three C files:
</p><ul>
<li>
<i>eul-mpz.c</i> &ndash; C interface for integer functions
</li>
<li>
<i>eul-mpq.c</i> &ndash; C interface for rational functions
</li>
<li>
<i>eul-gmp-gc.c</i> &ndash; C interface to GC

</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> To Do </h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>
rationals are not integrated into EuLisp
</li>
<li>
check everything is being GC-ed properly
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Danius Michaelides and Andreas Kind
<a href="mailto:no-reply">&lt;no-reply&gt;</a>
</p>
<p class="date"> Date: July 1997; Updated February 2010</p>
<p class="creator">HTML generated by org-mode 6.34trans in emacs 23</p>
</div>
</div>
</body>
</html>
